package datastructure;

/**
 * @author bin2.zhao (D52B48 in ZhangMen)
 * @since 2021/11/1 13:00
 */
public class Solution15 {

    /*
    【15-1】双指针
     */

    /**
     *【15-1-1】翻转字符串
     * 『力扣 - 344』
     */


    /**
     *【15-1-2】数对和
     *『面试题 16.24.』
     */


    /**
     *【15-1-3】两数之和
     *『力扣-1』
     */


    /**
     *【15-1-4】三数之和
     *『力扣-15』
     */


    /**
     *【15-1-5】调整数组顺序使奇数位于偶数前面
     *『剑指Offer 21.』
     */


    /**
     *【15-1-6】颜色分类
     *『力扣-75』
     */


    /**
     *【15-1-7】移动零（已排序、未排序指针）
     *『力扣-283』
     */


    /**
     *【15-1-8】最小差（类似合并两个有序数组）
     *『面试题 16.06』
     */


    /**
     *【15-1-9】单词距离（类似合并两个有序数组）
     *『面试题 17.11』
     */


    /*
    【15-2】滑动窗口
     */


    /**
     *【15-2-1】和为s的连续正数序列
     *『剑指Offer 57-II』
     */


    /**
     *【15-2-2】最长不含重复字符的子字符串
     *『剑指Offer 48.』
     */


    /**
     *【15-2-3】找到字符串中所有字母的异位次
     *『力扣-438』
     */


    /**
     *【15-2-4】最小覆盖子串
     *『力扣-76』
     */



    /*
    【15-3】前后缀统计
     */


    /**
     *【15-3-1】最大子序和
     *『力扣-53』
     */


    /**
     *【15-3-2】买卖股票的最佳时期
     *『力扣-121』
     */


    /**
     *【15-3-3】除自身以外数组的乘积
     *『力扣-238』
     */


    /**
     *【15-3-4】翻转数位
     *『面试题 05.03.』
     */


    /**
     *【15-3-5】接雨水
     *『力扣-42』
     */



    /*
    【15-4】位运算
     */

    /**
     *【15-4-1】位1的个数
     *『力扣-191』
     */


    /**
     *【15-4-2】汉明距离
     *『力扣-461』
     */


    /**
     *【15-4-3】整数转换
     *『面试题 05.06』
     */


    /**
     *【15-4-4】配对交换
     *『面试题 05.07』
     */


    /**
     *【15-4-5】插入
     *『面试题 05.01.』
     */


    /**
     *【15-4-6】消失的数字
     *『面试题 17.14.』
     */


    /**
     *【15-4-7】数组中数字出现的次数
     *『剑指Offer 56-I』
     */


    /**
     *【15-4-8】数组中数字出现的次数II
     *『剑指Offer 56-II』
     */


    /**
     *【15-4-9】交换数字
     *『面试题 16.01.』
     */


    /**
     *【15-4-10】2的幂
     *『力扣-231』
     */


}
